RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/HPM5361/hpm_csr_regs.h
/*
 * MPP (RW)
 *
 * MPP holds the privilege mode prior to a trap. Encoding for privilege mode is described in Table5. When U-mode is not available, this field is hardwired to 3.
 */
#define CSR_MSTATUS_MPP_MASK (0x1800U)
#define CSR_MSTATUS_MPP_SHIFT (11U)
#define CSR_MSTATUS_MPP_SET(x) (((uint32_t)(x) << CSR_MSTATUS_MPP_SHIFT) & CSR_MSTATUS_MPP_MASK)
#define CSR_MSTATUS_MPP_GET(x) (((uint32_t)(x) & CSR_MSTATUS_MPP_MASK) >> CSR_MSTATUS_MPP_SHIFT)

/*
 * MPIE (RW)
 *
 * MPIE holds the value of the MIE bit prior to a trap.
 */
#define CSR_MSTATUS_MPIE_MASK (0x80U)
#define CSR_MSTATUS_MPIE_SHIFT (7U)
#define CSR_MSTATUS_MPIE_SET(x) (((uint32_t)(x) << CSR_MSTATUS_MPIE_SHIFT) & CSR_MSTATUS_MPIE_MASK)
#define CSR_MSTATUS_MPIE_GET(x) (((uint32_t)(x) & CSR_MSTATUS_MPIE_MASK) >> CSR_MSTATUS_MPIE_SHIFT)

/*
 * UPIE (RW)
 *
 * UPIE holds the value of the UIE bit prior to a trap.
 */
#define CSR_MSTATUS_UPIE_MASK (0x10U)
#define CSR_MSTATUS_UPIE_SHIFT (4U)
#define CSR_MSTATUS_UPIE_SET(x) (((uint32_t)(x) << CSR_MSTATUS_UPIE_SHIFT) & CSR_MSTATUS_UPIE_MASK)
#define CSR_MSTATUS_UPIE_GET(x) (((uint32_t)(x) & CSR_MSTATUS_UPIE_MASK) >> CSR_MSTATUS_UPIE_SHIFT)

/*
 * MIE (RW)
 *
 * M mode interrupt enable bit.
 * 0: Disabled
 * 1: Enabled
 */
#define CSR_MSTATUS_MIE_MASK (0x8U)
#define CSR_MSTATUS_MIE_SHIFT (3U)
#define CSR_MSTATUS_MIE_SET(x) (((uint32_t)(x) << CSR_MSTATUS_MIE_SHIFT) & CSR_MSTATUS_MIE_MASK)
#define CSR_MSTATUS_MIE_GET(x) (((uint32_t)(x) & CSR_MSTATUS_MIE_MASK) >> CSR_MSTATUS_MIE_SHIFT)

/*
 * UIE (RW)
 *
 * U mode interrupt enable bit.
 * 0: Disabled
 * 1: Enabled
 */
#define CSR_MSTATUS_UIE_MASK (0x1U)
#define CSR_MSTATUS_UIE_SHIFT (0U)
#define CSR_MSTATUS_UIE_SET(x) (((uint32_t)(x) << CSR_MSTATUS_UIE_SHIFT) & CSR_MSTATUS_UIE_MASK)
#define CSR_MSTATUS_UIE_GET(x) (((uint32_t)(x) & CSR_MSTATUS_UIE_MASK) >> CSR_MSTATUS_UIE_SHIFT)

/* Bitfield definition for register: MISA */
/*
 * BASE (RO)
 *
 * The general-purpose register width of the native base integer ISA.
 * 0:Reserved
 * 1:32
 * 2:64
 * 3:128
 */
#define CSR_MISA_BASE_MASK (0xC0000000UL)
#define CSR_MISA_BASE_SHIFT (30U)
#define CSR_MISA_BASE_GET(x) (((uint32_t)(x) & CSR_MISA_BASE_MASK) >> CSR_MISA_BASE_SHIFT)

/*
 * Z (RO)
 *
 * Reserved
 */
#define CSR_MISA_Z_MASK (0x2000000UL)
#define CSR_MISA_Z_SHIFT (25U)
#define CSR_MISA_Z_GET(x) (((uint32_t)(x) & CSR_MISA_Z_MASK) >> CSR_MISA_Z_SHIFT)

/*
 * Y (RO)
 *
 * Reserved
 */
#define CSR_MISA_Y_MASK (0x1000000UL)
#define CSR_MISA_Y_SHIFT (24U)
#define CSR_MISA_Y_GET(x) (((uint32_t)(x) & CSR_MISA_Y_MASK) >> CSR_MISA_Y_SHIFT)

/*
 * X (RO)
 *
 * Non-standard extensions present
 */
#define CSR_MISA_X_MASK (0x800000UL)
#define CSR_MISA_X_SHIFT (23U)
#define CSR_MISA_X_GET(x) (((uint32_t)(x) & CSR_MISA_X_MASK) >> CSR_MISA_X_SHIFT)

/*
 * W (RO)
 *
 * Reserved
 */
#define CSR_MISA_W_MASK (0x400000UL)
#define CSR_MISA_W_SHIFT (22U)
#define CSR_MISA_W_GET(x) (((uint32_t)(x) & CSR_MISA_W_MASK) >> CSR_MISA_W_SHIFT)

/*
 * V (RO)
 *
 * Tentatively reserved for Vector extension
 */
#define CSR_MISA_V_MASK (0x200000UL)
#define CSR_MISA_V_SHIFT (21U)
#define CSR_MISA_V_GET(x) (((uint32_t)(x) & CSR_MISA_V_MASK) >> CSR_MISA_V_SHIFT)

/*
 * U (RO)
 *
 * User mode implemented
 * 0:Machine
 * 1:Machine + User / Machine + Supervisor + User
 */
#define CSR_MISA_U_MASK (0x100000UL)
#define CSR_MISA_U_SHIFT (20U)
#define CSR_MISA_U_GET(x) (((uint32_t)(x) & CSR_MISA_U_MASK) >> CSR_MISA_U_SHIFT)

/*
 * T (RO)
 *
 * Tentatively reserved for Transactional Memory extension
 */
#define CSR_MISA_T_MASK (0x80000UL)
#define CSR_MISA_T_SHIFT (19U)
#define CSR_MISA_T_GET(x) (((uint32_t)(x) & CSR_MISA_T_MASK) >> CSR_MISA_T_SHIFT)

/*
 * S (RO)
 *
 * Supervisor mode implemented
 * 0:Machine / Machine + User
 * 1:Machine + Supervisor + User
 */
#define CSR_MISA_S_MASK (0x40000UL)
#define CSR_MISA_S_SHIFT (18U)
#define CSR_MISA_S_GET(x) (((uint32_t)(x) & CSR_MISA_S_MASK) >> CSR_MISA_S_SHIFT)

/*
 * R (RO)
 *
 * Reserved
 */
#define CSR_MISA_R_MASK (0x20000UL)
#define CSR_MISA_R_SHIFT (17U)
#define CSR_MISA_R_GET(x) (((uint32_t)(x) & CSR_MISA_R_MASK) >> CSR_MISA_R_SHIFT)

/*
 * Q (RO)
 *
 * Quad-precision floating-point extension
 */
#define CSR_MISA_Q_MASK (0x10000UL)
#define CSR_MISA_Q_SHIFT (16U)
#define CSR_MISA_Q_GET(x) (((uint32_t)(x) & CSR_MISA_Q_MASK) >> CSR_MISA_Q_SHIFT)

/*
 * P (RO)
 *
 * Tentatively reserved for Packed-SIMD extension
 */
#define CSR_MISA_P_MASK (0x8000U)
#define CSR_MISA_P_SHIFT (15U)
#define CSR_MISA_P_GET(x) (((uint32_t)(x) & CSR_MISA_P_MASK) >> CSR_MISA_P_SHIFT)

/*
 * O (RO)
 *
 * Reserved
 */
#define CSR_MISA_O_MASK (0x4000U)
#define CSR_MISA_O_SHIFT (14U)
#define CSR_MISA_O_GET(x) (((uint32_t)(x) & CSR_MISA_O_MASK) >> CSR_MISA_O_SHIFT)

/*
 * N (RO)
 *
 * User-level interrupts supported
 * 0:no
 * 1:yes
 */
#define CSR_MISA_N_MASK (0x2000U)
#define CSR_MISA_N_SHIFT (13U)
#define CSR_MISA_N_GET(x) (((uint32_t)(x) & CSR_MISA_N_MASK) >> CSR_MISA_N_SHIFT)

/*
 * M (RO)
 *
 * Integer Multiply/Divide extension
 */
#define CSR_MISA_M_MASK (0x1000U)
#define CSR_MISA_M_SHIFT (12U)
#define CSR_MISA_M_GET(x) (((uint32_t)(x) & CSR_MISA_M_MASK) >> CSR_MISA_M_SHIFT)

/*
 * L (RO)
 *
 * Tentatively reserved for Decimal Floating-Point extension
 */
#define CSR_MISA_L_MASK (0x800U)
#define CSR_MISA_L_SHIFT (11U)
#define CSR_MISA_L_GET(x) (((uint32_t)(x) & CSR_MISA_L_MASK) >> CSR_MISA_L_SHIFT)

/*
 * K (RO)
 *
 * Reserved
 */
#define CSR_MISA_K_MASK (0x400U)
#define CSR_MISA_K_SHIFT (10U)
#define CSR_MISA_K_GET(x) (((uint32_t)(x) & CSR_MISA_K_MASK) >> CSR_MISA_K_SHIFT)

/*
 * J (RO)
 *
 * Tentatively reserved for Dynamically Translated Languages extension
 */
#define CSR_MISA_J_MASK (0x200U)
#define CSR_MISA_J_SHIFT (9U)
#define CSR_MISA_J_GET(x) (((uint32_t)(x) & CSR_MISA_J_MASK) >> CSR_MISA_J_SHIFT)

/*
 * I (RO)
 *
 * RV32I/64I/128I base ISA
 */
#define CSR_MISA_I_MASK (0x100U)
#define CSR_MISA_I_SHIFT (8U)
#define CSR_MISA_I_GET(x) (((uint32_t)(x) & CSR_MISA_I_MASK) >> CSR_MISA_I_SHIFT)

/*
 * H (RO)
 *
 * Reserved
 */
#define CSR_MISA_H_MASK (0x80U)
#define CSR_MISA_H_SHIFT (7U)
#define CSR_MISA_H_GET(x) (((uint32_t)(x) & CSR_MISA_H_MASK) >> CSR_MISA_H_SHIFT)

