RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/HPM5361/hpm_csr_regs.h
/* Bitfield definition for register: MIMPID */
/*
 * MAJOR (RO)
 *
 * Revision major
 */
#define CSR_MIMPID_MAJOR_MASK (0xFFFFFF00UL)
#define CSR_MIMPID_MAJOR_SHIFT (8U)
#define CSR_MIMPID_MAJOR_GET(x) (((uint32_t)(x) & CSR_MIMPID_MAJOR_MASK) >> CSR_MIMPID_MAJOR_SHIFT)

/*
 * MINOR (RO)
 *
 * Revision minor
 */
#define CSR_MIMPID_MINOR_MASK (0xF0U)
#define CSR_MIMPID_MINOR_SHIFT (4U)
#define CSR_MIMPID_MINOR_GET(x) (((uint32_t)(x) & CSR_MIMPID_MINOR_MASK) >> CSR_MIMPID_MINOR_SHIFT)

/*
 * EXTENSION (RO)
 *
 * Revision extension
 */
#define CSR_MIMPID_EXTENSION_MASK (0xFU)
#define CSR_MIMPID_EXTENSION_SHIFT (0U)
#define CSR_MIMPID_EXTENSION_GET(x) (((uint32_t)(x) & CSR_MIMPID_EXTENSION_MASK) >> CSR_MIMPID_EXTENSION_SHIFT)

/* Bitfield definition for register: MHARTID */
/*
 * MHARTID (RO)
 *
 * Hart ID
 */
#define CSR_MHARTID_MHARTID_MASK (0xFFFFFFFFUL)
#define CSR_MHARTID_MHARTID_SHIFT (0U)
#define CSR_MHARTID_MHARTID_GET(x) (((uint32_t)(x) & CSR_MHARTID_MHARTID_MASK) >> CSR_MHARTID_MHARTID_SHIFT)

/* NON-STANDARD CRS register bitfiled definitions */

/* Bitfield definition for register: MCOUNTINHIBIT */
/*
 * HPM6 (RW)
 *
 * See register description.
 */
#define CSR_MCOUNTINHIBIT_HPM6_MASK (0x40U)
#define CSR_MCOUNTINHIBIT_HPM6_SHIFT (6U)
#define CSR_MCOUNTINHIBIT_HPM6_SET(x) (((uint32_t)(x) << CSR_MCOUNTINHIBIT_HPM6_SHIFT) & CSR_MCOUNTINHIBIT_HPM6_MASK)
#define CSR_MCOUNTINHIBIT_HPM6_GET(x) (((uint32_t)(x) & CSR_MCOUNTINHIBIT_HPM6_MASK) >> CSR_MCOUNTINHIBIT_HPM6_SHIFT)

/*
 * HPM5 (RW)
 *
 * See register description.
 */
#define CSR_MCOUNTINHIBIT_HPM5_MASK (0x20U)
#define CSR_MCOUNTINHIBIT_HPM5_SHIFT (5U)
#define CSR_MCOUNTINHIBIT_HPM5_SET(x) (((uint32_t)(x) << CSR_MCOUNTINHIBIT_HPM5_SHIFT) & CSR_MCOUNTINHIBIT_HPM5_MASK)
#define CSR_MCOUNTINHIBIT_HPM5_GET(x) (((uint32_t)(x) & CSR_MCOUNTINHIBIT_HPM5_MASK) >> CSR_MCOUNTINHIBIT_HPM5_SHIFT)

/*
 * HPM4 (RW)
 *
 * See register description.
 */
#define CSR_MCOUNTINHIBIT_HPM4_MASK (0x10U)
#define CSR_MCOUNTINHIBIT_HPM4_SHIFT (4U)
#define CSR_MCOUNTINHIBIT_HPM4_SET(x) (((uint32_t)(x) << CSR_MCOUNTINHIBIT_HPM4_SHIFT) & CSR_MCOUNTINHIBIT_HPM4_MASK)
#define CSR_MCOUNTINHIBIT_HPM4_GET(x) (((uint32_t)(x) & CSR_MCOUNTINHIBIT_HPM4_MASK) >> CSR_MCOUNTINHIBIT_HPM4_SHIFT)

/*
 * HPM3 (RW)
 *
 * See register description.
 */
#define CSR_MCOUNTINHIBIT_HPM3_MASK (0x8U)
#define CSR_MCOUNTINHIBIT_HPM3_SHIFT (3U)
#define CSR_MCOUNTINHIBIT_HPM3_SET(x) (((uint32_t)(x) << CSR_MCOUNTINHIBIT_HPM3_SHIFT) & CSR_MCOUNTINHIBIT_HPM3_MASK)
#define CSR_MCOUNTINHIBIT_HPM3_GET(x) (((uint32_t)(x) & CSR_MCOUNTINHIBIT_HPM3_MASK) >> CSR_MCOUNTINHIBIT_HPM3_SHIFT)

/*
 * IR (RW)
 *
 * See register description.
 */
#define CSR_MCOUNTINHIBIT_IR_MASK (0x4U)
#define CSR_MCOUNTINHIBIT_IR_SHIFT (2U)
#define CSR_MCOUNTINHIBIT_IR_SET(x) (((uint32_t)(x) << CSR_MCOUNTINHIBIT_IR_SHIFT) & CSR_MCOUNTINHIBIT_IR_MASK)
#define CSR_MCOUNTINHIBIT_IR_GET(x) (((uint32_t)(x) & CSR_MCOUNTINHIBIT_IR_MASK) >> CSR_MCOUNTINHIBIT_IR_SHIFT)

/*
 * TM (RW)
 *
 * See register description.
 */
#define CSR_MCOUNTINHIBIT_TM_MASK (0x2U)
#define CSR_MCOUNTINHIBIT_TM_SHIFT (1U)
#define CSR_MCOUNTINHIBIT_TM_SET(x) (((uint32_t)(x) << CSR_MCOUNTINHIBIT_TM_SHIFT) & CSR_MCOUNTINHIBIT_TM_MASK)
#define CSR_MCOUNTINHIBIT_TM_GET(x) (((uint32_t)(x) & CSR_MCOUNTINHIBIT_TM_MASK) >> CSR_MCOUNTINHIBIT_TM_SHIFT)

/*
 * CY (RW)
 *
 * See register description.
 */
#define CSR_MCOUNTINHIBIT_CY_MASK (0x1U)
#define CSR_MCOUNTINHIBIT_CY_SHIFT (0U)
#define CSR_MCOUNTINHIBIT_CY_SET(x) (((uint32_t)(x) << CSR_MCOUNTINHIBIT_CY_SHIFT) & CSR_MCOUNTINHIBIT_CY_MASK)
#define CSR_MCOUNTINHIBIT_CY_GET(x) (((uint32_t)(x) & CSR_MCOUNTINHIBIT_CY_MASK) >> CSR_MCOUNTINHIBIT_CY_SHIFT)

/* Bitfield definition for register: MILMB */
/*
 * IBPA (RO)
 *
 * The base physical address of ILM. It has to be an integer multiple of the ILM size
 */
#define CSR_MILMB_IBPA_MASK (0xFFFFFC00UL)
#define CSR_MILMB_IBPA_SHIFT (10U)
#define CSR_MILMB_IBPA_GET(x) (((uint32_t)(x) & CSR_MILMB_IBPA_MASK) >> CSR_MILMB_IBPA_SHIFT)

/*
 * RWECC (RW)
 *
 * Controls diagnostic accesses of ECC codes of the ILM RAMs. When set, load/store to ILM reads/writes ECC codes to the mecc_code register. This bit can be set for injecting ECC errors to test the ECC handler.
 * 0:Disable diagnostic accesses of ECC codes
 * 1:Enable diagnostic accesses of ECC codes
 */
#define CSR_MILMB_RWECC_MASK (0x8U)
#define CSR_MILMB_RWECC_SHIFT (3U)
#define CSR_MILMB_RWECC_SET(x) (((uint32_t)(x) << CSR_MILMB_RWECC_SHIFT) & CSR_MILMB_RWECC_MASK)
#define CSR_MILMB_RWECC_GET(x) (((uint32_t)(x) & CSR_MILMB_RWECC_MASK) >> CSR_MILMB_RWECC_SHIFT)

/*
 * ECCEN (RW)
 *
 * Parity/ECC enable control:
 * 0:Disable parity/ECC
 * 1:Reserved
 * 2:Generate exceptions only on uncorrectable parity/ECC errors
 * 3:Generate exceptions on any type of parity/ECC errors
 */
#define CSR_MILMB_ECCEN_MASK (0x6U)
#define CSR_MILMB_ECCEN_SHIFT (1U)
#define CSR_MILMB_ECCEN_SET(x) (((uint32_t)(x) << CSR_MILMB_ECCEN_SHIFT) & CSR_MILMB_ECCEN_MASK)
#define CSR_MILMB_ECCEN_GET(x) (((uint32_t)(x) & CSR_MILMB_ECCEN_MASK) >> CSR_MILMB_ECCEN_SHIFT)

/*
 * IEN (RO)
 *
 * ILM enable control:
 * 0:ILM is disabled
 * 1:ILM is enabled
 */
#define CSR_MILMB_IEN_MASK (0x1U)
#define CSR_MILMB_IEN_SHIFT (0U)
#define CSR_MILMB_IEN_GET(x) (((uint32_t)(x) & CSR_MILMB_IEN_MASK) >> CSR_MILMB_IEN_SHIFT)

/* Bitfield definition for register: MDLMB */
/*
 * DBPA (RO)
 *
 * The base physical address of DLM. It has to be an integer multiple of the DLM size
 */
#define CSR_MDLMB_DBPA_MASK (0xFFFFFC00UL)
#define CSR_MDLMB_DBPA_SHIFT (10U)
#define CSR_MDLMB_DBPA_GET(x) (((uint32_t)(x) & CSR_MDLMB_DBPA_MASK) >> CSR_MDLMB_DBPA_SHIFT)

/*
 * RWECC (RW)
 *
 * Controls diagnostic accesses of ECC codes of the DLM RAMs. When set, load/store to DLM reads/writes ECC codes to the mecc_code register. This bit can be set for injecting ECC errors to test the ECC handler.
 * 0:Disable diagnostic accesses of ECC codes
 * 1:Enable diagnostic accesses of ECC codes
 */
#define CSR_MDLMB_RWECC_MASK (0x8U)
#define CSR_MDLMB_RWECC_SHIFT (3U)
#define CSR_MDLMB_RWECC_SET(x) (((uint32_t)(x) << CSR_MDLMB_RWECC_SHIFT) & CSR_MDLMB_RWECC_MASK)
#define CSR_MDLMB_RWECC_GET(x) (((uint32_t)(x) & CSR_MDLMB_RWECC_MASK) >> CSR_MDLMB_RWECC_SHIFT)

