RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/HPM5361/hpm_csr_regs.h
/*
 * T_LEVEL (RW)
 *
 * Throttling Level. The processor has the highest performance at throttling level 0 and the lowest
 * performance at throttling level 15.
 * 0:Level 0 (the highest performance)
 * 1-14:Level 1-14
 * 15:Level 15 (the lowest performance)
 */
#define CSR_MPFT_CTL_T_LEVEL_MASK (0xF0U)
#define CSR_MPFT_CTL_T_LEVEL_SHIFT (4U)
#define CSR_MPFT_CTL_T_LEVEL_SET(x) (((uint32_t)(x) << CSR_MPFT_CTL_T_LEVEL_SHIFT) & CSR_MPFT_CTL_T_LEVEL_MASK)
#define CSR_MPFT_CTL_T_LEVEL_GET(x) (((uint32_t)(x) & CSR_MPFT_CTL_T_LEVEL_MASK) >> CSR_MPFT_CTL_T_LEVEL_SHIFT)

/* Bitfield definition for register: MHSP_CTL */
/*
 * M (RW)
 *
 * Enables the SP protection and recording mechanism in Machine mode
 * 0:The mechanism is disabled in Machine mode.
 * 1: The mechanism is enabled in Machine mode.
 */
#define CSR_MHSP_CTL_M_MASK (0x20U)
#define CSR_MHSP_CTL_M_SHIFT (5U)
#define CSR_MHSP_CTL_M_SET(x) (((uint32_t)(x) << CSR_MHSP_CTL_M_SHIFT) & CSR_MHSP_CTL_M_MASK)
#define CSR_MHSP_CTL_M_GET(x) (((uint32_t)(x) & CSR_MHSP_CTL_M_MASK) >> CSR_MHSP_CTL_M_SHIFT)

/*
 * S (RW)
 *
 * Enables the SP protection and recording mechanism in Supervisor mode
 * 0:The mechanism is disabled in Supervisor mode
 * 1:The mechanism is enabled in Supervisor mode
 */
#define CSR_MHSP_CTL_S_MASK (0x10U)
#define CSR_MHSP_CTL_S_SHIFT (4U)
#define CSR_MHSP_CTL_S_SET(x) (((uint32_t)(x) << CSR_MHSP_CTL_S_SHIFT) & CSR_MHSP_CTL_S_MASK)
#define CSR_MHSP_CTL_S_GET(x) (((uint32_t)(x) & CSR_MHSP_CTL_S_MASK) >> CSR_MHSP_CTL_S_SHIFT)

/*
 * U (RW)
 *
 * Enables the SP protection and recording mechanism in User mode
 * 0:The mechanism is disabled in User mode
 * 1:The mechanism is enabled in User mode.
 */
#define CSR_MHSP_CTL_U_MASK (0x8U)
#define CSR_MHSP_CTL_U_SHIFT (3U)
#define CSR_MHSP_CTL_U_SET(x) (((uint32_t)(x) << CSR_MHSP_CTL_U_SHIFT) & CSR_MHSP_CTL_U_MASK)
#define CSR_MHSP_CTL_U_GET(x) (((uint32_t)(x) & CSR_MHSP_CTL_U_MASK) >> CSR_MHSP_CTL_U_SHIFT)

/*
 * SCHM (RW)
 *
 * Selects the operating scheme of the stack protection and recording mechanism
 * 0:Stack overflow/underflow detection
 * 1:Top-of-stack recording
 */
#define CSR_MHSP_CTL_SCHM_MASK (0x4U)
#define CSR_MHSP_CTL_SCHM_SHIFT (2U)
#define CSR_MHSP_CTL_SCHM_SET(x) (((uint32_t)(x) << CSR_MHSP_CTL_SCHM_SHIFT) & CSR_MHSP_CTL_SCHM_MASK)
#define CSR_MHSP_CTL_SCHM_GET(x) (((uint32_t)(x) & CSR_MHSP_CTL_SCHM_MASK) >> CSR_MHSP_CTL_SCHM_SHIFT)

/*
 * UDF_EN (RW)
 *
 * Enable bit for the stack underflow protection mechanism. This bit will be cleared to 0 automatically by hardware when a stack protection (overflow or underflow) exception is taken.
 * 0:The stack underflow protection is disabled
 * 1:The stack underflow protection is enabled.
 */
#define CSR_MHSP_CTL_UDF_EN_MASK (0x2U)
#define CSR_MHSP_CTL_UDF_EN_SHIFT (1U)
#define CSR_MHSP_CTL_UDF_EN_SET(x) (((uint32_t)(x) << CSR_MHSP_CTL_UDF_EN_SHIFT) & CSR_MHSP_CTL_UDF_EN_MASK)
#define CSR_MHSP_CTL_UDF_EN_GET(x) (((uint32_t)(x) & CSR_MHSP_CTL_UDF_EN_MASK) >> CSR_MHSP_CTL_UDF_EN_SHIFT)

/*
 * OVF_EN (RW)
 *
 * Enable bit for the stack overflow protection and recording mechanism. This bit will be cleared to 0 automatically by hardware when a stack protection (overflow or underflow) exception is taken.
 * 0:The stack overflow protection and recording mechanism are disabled.
 * 1:The stack overflow protection and recording mechanism are enabled.
 */
#define CSR_MHSP_CTL_OVF_EN_MASK (0x1U)
#define CSR_MHSP_CTL_OVF_EN_SHIFT (0U)
#define CSR_MHSP_CTL_OVF_EN_SET(x) (((uint32_t)(x) << CSR_MHSP_CTL_OVF_EN_SHIFT) & CSR_MHSP_CTL_OVF_EN_MASK)
#define CSR_MHSP_CTL_OVF_EN_GET(x) (((uint32_t)(x) & CSR_MHSP_CTL_OVF_EN_MASK) >> CSR_MHSP_CTL_OVF_EN_SHIFT)

/* Bitfield definition for register: MSP_BOUND */
/*
 * MSP_BOUND (RW)
 *
 * Machine SP Bound
 */
#define CSR_MSP_BOUND_MSP_BOUND_MASK (0xFFFFFFFFUL)
#define CSR_MSP_BOUND_MSP_BOUND_SHIFT (0U)
#define CSR_MSP_BOUND_MSP_BOUND_SET(x) (((uint32_t)(x) << CSR_MSP_BOUND_MSP_BOUND_SHIFT) & CSR_MSP_BOUND_MSP_BOUND_MASK)
#define CSR_MSP_BOUND_MSP_BOUND_GET(x) (((uint32_t)(x) & CSR_MSP_BOUND_MSP_BOUND_MASK) >> CSR_MSP_BOUND_MSP_BOUND_SHIFT)

/* Bitfield definition for register: MSP_BASE */
/*
 * SP_BASE (RW)
 *
 * Machine SP base
 */
#define CSR_MSP_BASE_SP_BASE_MASK (0xFFFFFFFFUL)
#define CSR_MSP_BASE_SP_BASE_SHIFT (0U)
#define CSR_MSP_BASE_SP_BASE_SET(x) (((uint32_t)(x) << CSR_MSP_BASE_SP_BASE_SHIFT) & CSR_MSP_BASE_SP_BASE_MASK)
#define CSR_MSP_BASE_SP_BASE_GET(x) (((uint32_t)(x) & CSR_MSP_BASE_SP_BASE_MASK) >> CSR_MSP_BASE_SP_BASE_SHIFT)

/* Bitfield definition for register: MDCAUSE */
/*
 * MDCAUSE (RW)
 *
 * This register further disambiguates causes of traps recorded in the mcause register.
 * The value of MDCAUSE for precise exception:
 *   When mcause == 1 (Instruction access fault):
 *     0:Reserved; 1:ECC/Parity error; 2:PMP instruction access violation; 3:Bus error; 4:PMA empty hole access
 *   When mcause == 2 (Illegal instruction):
 *     0:Please parse the mtval CSR; 1:FP disabled exception; 2:ACE disabled exception
 *   When mcause == 5 (Load access fault):
 *     0:Reserved; 1:ECC/Parity error; 2:PMP load access violation; 3:Bus error; 4:Misaligned address; 5:PMA empty hole access; 6:PMA attribute inconsistency; 7:PMA NAMO exception
 *   When mcause == 7 (Store access fault):
 *     0:Reserved; 1:ECC/Parity error; 2:PMP load access violation; 3:Bus error; 4:Misaligned address; 5:PMA empty hole access; 6:PMA attribute inconsistency; 7:PMA NAMO exception
 * The value of MDCAUSE for imprecise exception:
 *   When mcause == Local Interrupt 16 or Local Interrupt 272 (16 + 256) (ECC error local interrupt)
 *     0:Reserved; 1:LM slave port ECC/Parity error; 2:Imprecise store ECC/Parity error; 3:Imprecise load ECC/Parity error
 *   When mcause == Local Interrupt 17 or Local Interrupt 273 (17 + 256) (Bus read/write transaction error local interrupt)
 *     0:Reserved; 1:Bus read error; 2:Bus write error; 3:PMP error caused by load instructions; 4:PMP error caused by store instructions; 5:PMA error caused by load instructions; 6:PMA error caused by store instructions
 */
#define CSR_MDCAUSE_MDCAUSE_MASK (0x7U)
#define CSR_MDCAUSE_MDCAUSE_SHIFT (0U)
#define CSR_MDCAUSE_MDCAUSE_SET(x) (((uint32_t)(x) << CSR_MDCAUSE_MDCAUSE_SHIFT) & CSR_MDCAUSE_MDCAUSE_MASK)
#define CSR_MDCAUSE_MDCAUSE_GET(x) (((uint32_t)(x) & CSR_MDCAUSE_MDCAUSE_MASK) >> CSR_MDCAUSE_MDCAUSE_SHIFT)

