RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/HPM5361/hpm_csr_regs.h
/*
 * HPM5 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_M_HPM5_MASK (0x20U)
#define CSR_MCOUNTERMASK_M_HPM5_SHIFT (5U)
#define CSR_MCOUNTERMASK_M_HPM5_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_M_HPM5_SHIFT) & CSR_MCOUNTERMASK_M_HPM5_MASK)
#define CSR_MCOUNTERMASK_M_HPM5_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_M_HPM5_MASK) >> CSR_MCOUNTERMASK_M_HPM5_SHIFT)

/*
 * HPM4 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_M_HPM4_MASK (0x10U)
#define CSR_MCOUNTERMASK_M_HPM4_SHIFT (4U)
#define CSR_MCOUNTERMASK_M_HPM4_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_M_HPM4_SHIFT) & CSR_MCOUNTERMASK_M_HPM4_MASK)
#define CSR_MCOUNTERMASK_M_HPM4_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_M_HPM4_MASK) >> CSR_MCOUNTERMASK_M_HPM4_SHIFT)

/*
 * HPM3 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_M_HPM3_MASK (0x8U)
#define CSR_MCOUNTERMASK_M_HPM3_SHIFT (3U)
#define CSR_MCOUNTERMASK_M_HPM3_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_M_HPM3_SHIFT) & CSR_MCOUNTERMASK_M_HPM3_MASK)
#define CSR_MCOUNTERMASK_M_HPM3_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_M_HPM3_MASK) >> CSR_MCOUNTERMASK_M_HPM3_SHIFT)

/*
 * IR (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_M_IR_MASK (0x4U)
#define CSR_MCOUNTERMASK_M_IR_SHIFT (2U)
#define CSR_MCOUNTERMASK_M_IR_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_M_IR_SHIFT) & CSR_MCOUNTERMASK_M_IR_MASK)
#define CSR_MCOUNTERMASK_M_IR_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_M_IR_MASK) >> CSR_MCOUNTERMASK_M_IR_SHIFT)

/*
 * CY (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_M_CY_MASK (0x1U)
#define CSR_MCOUNTERMASK_M_CY_SHIFT (0U)
#define CSR_MCOUNTERMASK_M_CY_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_M_CY_SHIFT) & CSR_MCOUNTERMASK_M_CY_MASK)
#define CSR_MCOUNTERMASK_M_CY_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_M_CY_MASK) >> CSR_MCOUNTERMASK_M_CY_SHIFT)

/* Bitfield definition for register: MCOUNTERMASK_S */
/*
 * HPM6 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_S_HPM6_MASK (0x40U)
#define CSR_MCOUNTERMASK_S_HPM6_SHIFT (6U)
#define CSR_MCOUNTERMASK_S_HPM6_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_S_HPM6_SHIFT) & CSR_MCOUNTERMASK_S_HPM6_MASK)
#define CSR_MCOUNTERMASK_S_HPM6_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_S_HPM6_MASK) >> CSR_MCOUNTERMASK_S_HPM6_SHIFT)

/*
 * HPM5 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_S_HPM5_MASK (0x20U)
#define CSR_MCOUNTERMASK_S_HPM5_SHIFT (5U)
#define CSR_MCOUNTERMASK_S_HPM5_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_S_HPM5_SHIFT) & CSR_MCOUNTERMASK_S_HPM5_MASK)
#define CSR_MCOUNTERMASK_S_HPM5_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_S_HPM5_MASK) >> CSR_MCOUNTERMASK_S_HPM5_SHIFT)

/*
 * HPM4 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_S_HPM4_MASK (0x10U)
#define CSR_MCOUNTERMASK_S_HPM4_SHIFT (4U)
#define CSR_MCOUNTERMASK_S_HPM4_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_S_HPM4_SHIFT) & CSR_MCOUNTERMASK_S_HPM4_MASK)
#define CSR_MCOUNTERMASK_S_HPM4_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_S_HPM4_MASK) >> CSR_MCOUNTERMASK_S_HPM4_SHIFT)

/*
 * HPM3 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_S_HPM3_MASK (0x8U)
#define CSR_MCOUNTERMASK_S_HPM3_SHIFT (3U)
#define CSR_MCOUNTERMASK_S_HPM3_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_S_HPM3_SHIFT) & CSR_MCOUNTERMASK_S_HPM3_MASK)
#define CSR_MCOUNTERMASK_S_HPM3_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_S_HPM3_MASK) >> CSR_MCOUNTERMASK_S_HPM3_SHIFT)

/*
 * IR (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_S_IR_MASK (0x4U)
#define CSR_MCOUNTERMASK_S_IR_SHIFT (2U)
#define CSR_MCOUNTERMASK_S_IR_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_S_IR_SHIFT) & CSR_MCOUNTERMASK_S_IR_MASK)
#define CSR_MCOUNTERMASK_S_IR_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_S_IR_MASK) >> CSR_MCOUNTERMASK_S_IR_SHIFT)

/*
 * CY (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_S_CY_MASK (0x1U)
#define CSR_MCOUNTERMASK_S_CY_SHIFT (0U)
#define CSR_MCOUNTERMASK_S_CY_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_S_CY_SHIFT) & CSR_MCOUNTERMASK_S_CY_MASK)
#define CSR_MCOUNTERMASK_S_CY_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_S_CY_MASK) >> CSR_MCOUNTERMASK_S_CY_SHIFT)

/* Bitfield definition for register: MCOUNTERMASK_U */
/*
 * HPM6 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_U_HPM6_MASK (0x40U)
#define CSR_MCOUNTERMASK_U_HPM6_SHIFT (6U)
#define CSR_MCOUNTERMASK_U_HPM6_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_U_HPM6_SHIFT) & CSR_MCOUNTERMASK_U_HPM6_MASK)
#define CSR_MCOUNTERMASK_U_HPM6_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_U_HPM6_MASK) >> CSR_MCOUNTERMASK_U_HPM6_SHIFT)

/*
 * HPM5 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_U_HPM5_MASK (0x20U)
#define CSR_MCOUNTERMASK_U_HPM5_SHIFT (5U)
#define CSR_MCOUNTERMASK_U_HPM5_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_U_HPM5_SHIFT) & CSR_MCOUNTERMASK_U_HPM5_MASK)
#define CSR_MCOUNTERMASK_U_HPM5_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_U_HPM5_MASK) >> CSR_MCOUNTERMASK_U_HPM5_SHIFT)

/*
 * HPM4 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_U_HPM4_MASK (0x10U)
#define CSR_MCOUNTERMASK_U_HPM4_SHIFT (4U)
#define CSR_MCOUNTERMASK_U_HPM4_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_U_HPM4_SHIFT) & CSR_MCOUNTERMASK_U_HPM4_MASK)
#define CSR_MCOUNTERMASK_U_HPM4_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_U_HPM4_MASK) >> CSR_MCOUNTERMASK_U_HPM4_SHIFT)

/*
 * HPM3 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_U_HPM3_MASK (0x8U)
#define CSR_MCOUNTERMASK_U_HPM3_SHIFT (3U)
#define CSR_MCOUNTERMASK_U_HPM3_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_U_HPM3_SHIFT) & CSR_MCOUNTERMASK_U_HPM3_MASK)
#define CSR_MCOUNTERMASK_U_HPM3_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_U_HPM3_MASK) >> CSR_MCOUNTERMASK_U_HPM3_SHIFT)

/*
 * IR (RW)
 *
 * See register description
 */
#define CSR_MCOUNTERMASK_U_IR_MASK (0x4U)
#define CSR_MCOUNTERMASK_U_IR_SHIFT (2U)
#define CSR_MCOUNTERMASK_U_IR_SET(x) (((uint32_t)(x) << CSR_MCOUNTERMASK_U_IR_SHIFT) & CSR_MCOUNTERMASK_U_IR_MASK)
#define CSR_MCOUNTERMASK_U_IR_GET(x) (((uint32_t)(x) & CSR_MCOUNTERMASK_U_IR_MASK) >> CSR_MCOUNTERMASK_U_IR_SHIFT)

